Count
Syntax
SapObject.SapModel.NamedAssign.ModifierFrame.Count
VB6 Procedure
Function Count() As Long
Parameters
None
Remarks
This function returns the total number of defined frame property modifiers in the model.
VBA Example
Sub CountFramePropModifiers()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim Count As Long
 Dim i As Long
 Dim Value() As Double
 'create Sap2000 object
 Set SapObject = CreateObject("CSI.SAP2000.API.SapObject")
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 3, 124, 3, 200)
 'add new property modifier
 ReDim Value(7)
 For i = 0 To 7
 Value(i) = 1
 Next i
 Value(5) = 100
 ret = SapModel.NamedAssign.ModifierFrame.SetModifiers("FMOD1", Value)
 Value(5) = 10
 ret = SapModel.NamedAssign.ModifierFrame.SetModifiers("FMOD2", Value)
 'return number of defined property modifiers
 Count = SapModel.NamedAssign.ModifierFrame.Count
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 12.00.
See Also